# математичні операції
print("Додавання: 7 + 3 =", 7 + 3)
print("Віднімання: 7 - 3 =", 7 - 3)
print("Множення: 7 * 3 =", 7 * 3)
print("Дійсне ділення числа: 7 / 3 =", 7 / 3)
print("Ділення цілого числа: 7 // 3=", 7 // 2)
print("Зведення числа в степінь: 7 ** 3 =", 7 ** 3)
print("Залишок від ділення числа: 7 % 3 =", 7 % 3)

# порядок операцій
print("5 + 30 * 20 =", 5 + 30 * 20) # множення виконується першим
print("(5 + 30) * 20 =", (5 + 30) * 20) # спочатку виконується операция в дужках
print("(( 5 + 30) * 20) / 10 =", (( 5 + 30) * 20) / 10) # вкладені дужки

# Операції ділення
print("923 % 10 =", 923 % 10)
print("923 // 10 =", 923 // 10)

# Операції з дійсними числами
print(0.5)
print("0.5 + 0.8 =", 0.5 + 0.8)
print("5 / 2 =", 5 / 2)

# вилучення кореню
print("9 ** 0.5 =", 9 ** 0.5)

# експонента
print("5e-1 =", 5e-1)
print("1234e-2 =", 1234e-2)
print("1234e2 =", 1234e2)
print("1234e3 =", 1234e3)
